#### DockablePanes.BuiltInDockablePanes Members

---

|  |
| --- |
| DockablePanes BuiltInDockablePanes Class   Properties   See Also |

Provides a container of all Revit built-in DockablePaneId instances.

The  DockablePanes BuiltInDockablePanes  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ContentDelivery | The content delivery pane. |
| Public property Static member | ElementView | The element view pane. |
| Public property Static member | FabricationPartBrowser | The Fabrication part browser pane. |
| Public property Static member | HostByLinkNavigator | The host by link navigator pane. |
| Public property Static member | PnIdModelerBrowser | The P&ID modeler browser pane. |
| Public property Static member | ProjectBrowser | The project browser pane. |
| Public property Static member | PropertiesPalette | The properties palette pane. |
| Public property Static member | RebarBrowser | The rebar browser pane. |
| Public property Static member | SystemNavigator | The system browser pane. |
| Public property Static member | ViewBrowser | The View browser pane. |

# See Also

DockablePanes BuiltInDockablePanes Class

Autodesk.Revit.UI Namespace